clear all
format bank
%% Начальные данные
sigma_iz = 220*10^6;
sigma_sm_iz = 360*10^6;
t_iz = 125*10^6;
% Моменты на водилах планетарных рядов
K_1 = [0.00 0.00 -0.31 -0.43 0.00 0.32 0.28 0.00 -1.00 -1.00];
K_2 = [0.00 1.34 0.92 0.77 0.00 -0.59 -0.52 -0.44 2.92 1.81];
K_3 = [1.59 1.59 1.09 0.92 0.40 0.00 0.00 0.00 0.00 0.00];
K_4 = [4.61 2.05 1.40 1.18 1.15 1.12 1.00 0.85 -5.57 -3.46];
A = [3 3 3 4];% Количество сателлитов
K_ner = [1 1 1 1];% Коэффициент неравномерности
R_st = [68.3282 65.2224 68.3282 66.2577]*10^(-3);% Радиус, на котором расположены оси сателлитов
M_max = 750; % Макс момент двигателя
n_dvs_max = 3000;% Макс число оборотов двигателя
ro = 7874;% Плотность легированной стали
b_st = [15 20 15 30]*10^(-3);% Ширина сателлита
D_st = [33.1288 41.411 35.1994 41.411]*10^(-3);% Делительный диаметр сателлита
d_st = [15 20 15 20]*10^(-3);% Внешний диаметр оси сателлита
d_0_st = [10 15 10 15]*10^(-3);% Диаметр отверстия в оси сателлита
%Угловые скорости сателлитов
% K_vod_1 = [-11.321 -5.125 0.000 3.125 3.644 3.125 0.000 -5.125 0.000 3.125];
% K_vod_2 = [2.628 0.900 -0.529 -1.401 -1.546 -1.326 0.000 2.174 -2.174 -3.499];
% K_vod_3 = [1.799 1.799 1.799 1.799 1.799 1.543 0.000 -2.530 7.387 8.929];
% K_vod_4 = [-0.917 -0.314 0.185 0.489 0.539 0.462 0.000 -0.758 0.758 1.221];

K_vod_1 = [1.000 1.000 1.000 1.000 1.000 1.000 1.000 1.000 1.000 1.000];
K_vod_2 = [0.000 0.414 0.756 0.965 1.000 1.000 1.000 1.000 0.000 0.000];
K_vod_3 = [0.630 0.630 0.630 0.630 0.630 0.682 1.000 1.521 -0.521 -0.838];
K_vod_4 = [0.217 0.488 0.713 0.850 0.872 0.890 1.000 1.180 -0.180 -0.289];
l = [25 30 25 40]*10^(-3);% Длина оси сателлита
delta = [4 4 4 4]*10^(-3); % толщина щеки
%% Расчет
[K_1_1, I_1_1] = max(abs(K_1));
[K_2_1, I_2_1] = max(abs(K_2));
[K_3_1, I_3_1] = max(abs(K_3));
[K_4_1, I_4_1] = max(abs(K_4));
K1 = [K_1_1 K_2_1 K_3_1 K_4_1];
K = [K_1(I_1_1) K_2(I_2_1) K_3(I_3_1) K_4(I_4_1)];
[K_vod_1_1, I_vod_1_1] = max(abs(K_vod_1));
[K_vod_2_1, I_vod_2_1] = max(abs(K_vod_2));
[K_vod_3_1, I_vod_3_1] = max(abs(K_vod_3));
[K_vod_4_1, I_vod_4_1] = max(abs(K_vod_4));
K_vod1 = [K_vod_1_1 K_vod_2_1 K_vod_3_1 K_vod_4_1];
K_vod = [K_vod_1(I_vod_1_1) K_vod_2(I_vod_2_1) K_vod_3(I_vod_3_1) K_vod_4(I_vod_4_1)];
F_vod = K.*M_max.*K_ner./(A.*R_st); % Радиальная нагрузка на оси сателита
F_vod_1 = K_1(1)*M_max*K_ner(1)./(A.*R_st(1)); % Радиальная нагрузка на оси сателита 1 зад перед
V = pi.*b_st.*(D_st.^2-d_st.^2)/4;
m_st = ro*V;
omega = (K_vod*2*n_dvs_max*pi)/60;
% omega(1) = (K_vod(1)*2*1500*pi)/60;
% P_ch = m_st.*omega.*R_st;
P_ch = m_st.*omega.^2.*R_st;
F_r = (F_vod.^2+P_ch.^2).^(1/2);
% ур-ние моментов относительно опоры 1
N_x = 1/2.*F_r; % максимальное на 3 ряду диаметр сателита 50
N_x_1 = N_x;
M_i = N_x.*l./2;
W = 0.2*d_st.^3.*(1-(d_0_st.^4/d_st.^4));
W_1=W.*10^9;
sigma = M_i./W;
Zapas_prochnosti_si = sigma_iz./sigma;
if min(Zapas_prochnosti_si) > 1.15
 disp ('По прочности прошло)')
else
 disp ('Проблемы с прочностью(')
end
% срез
t_sr = 4*N_x./(pi*(d_st.^2-d_0_st.^2));
Zapas_prochnosti_t_sr = t_iz./t_sr;
if min(Zapas_prochnosti_t_sr) > 1.15
 disp ('Срез по прочности прошло)')
else
 disp ('Срез проблемы с прочностью(')
end
% смятие
sigma_sm = N_x./(delta.*d_st);
Zapas_prochnosti_sm = sigma_sm_iz./sigma_sm;
if min(Zapas_prochnosti_sm) > 1.15
 disp ('Смятие по прочности прошло)')
else
 disp ('Смятие проблемы с прочностью(')
end

SKI = [Zapas_prochnosti_si; Zapas_prochnosti_t_sr; Zapas_prochnosti_sm];