%
% ПРОГРАММА РАСЧЕТА ЗУБЧАТЫХ КОЛЕС ПЛАНЕТАРНОГО РЯДА НА ВЫНОСЛИВОСТЬ И
% ДЕЙСТВИЕ МАКСИМАЛЬНОЙ НАГРУЗКИ
%
clear, clc
global STAL1 STAL2 STAL3 STAL4 WWW fid
addpath([pwd '\function'])
%
%    ВВОД ИСХОДНЫХ ДАННЫХ
%
% Марки стали, характеристики которых имеются в базе данных:
% 
% 35; 40; 45; 50; 50Г; 60Г; 15Х; 20Х; 35Х; 40Х; 45Х; 40ХС; 40ХН; 45ХН;
% 20ХР; 20ХГР; 20ХНР; 35ХРА; 40ХГР; 12ХН3А; 12Х2Н4А; 20Х2Н4А; 12Х2Н4ВА;
% 18ХГТ; 38ХМЮА; 38ХВФЮ; 12ХН3; 20ХН3; 18Х2Н4ВА; 25Х2ГНТА; 12ХН3А; 38ХН3МА;
% 38ХН3МФА; 20ХНМ. 
%
% Определите из перечисленных выше мароку стали зубчатых колес:
%
STAL1='20ХНМ ';        %   МЦК
STAL2='20ХНМ ';        %   САТ1-МЦК
STAL3='20ХНМ ';        %   САТ2-БЦК
STAL4='20ХНМ ';        %   БЦК
%
% Определение файла, где расположены исходные данные
WWW=xlsread('dannye\PR1');
%
% Определение файла, куда будут записаны результаты расчетов
fid=fopen('resultat\PR1.doc','w+');
%
MMM=1;
[TTT] = PROGRAMM (MMM);