function [TTR] = PRNTD
global FC BM CR X0 Y0 KB KT V PR A23 L10 LT LS fid TIP
%
TTR=0;
fprintf (fid,'\n йнщт., гюбхяъыхи нр ценлерпхх, рнвмнярх х люрепхюкю ондьхомхйю:');
fprintf (fid,'\n F(c): %g ',FC);
fprintf (fid,'\n йнщттхжхемр, уюпюйрепхгсчыхи ябниярбю ярюкх:');
fprintf (fid,'\n B(m):- %g ',BM);
fprintf (fid,'\n йнщттхжхемрш дхмюлхвеяйху пюдхюкэмни х няебни мюцпсгнй:');
fprintf (fid,'\n X= %g; Y= %g',X0,Y0);
fprintf (fid,'\n дхмюлхвеяйхи йнщттхжхемр K(а)= %g',KB);
fprintf (fid,'\n релоепюрспмши йнщттхжхемр й(р)= %g',KT);
fprintf (fid,'\n йнщттхжхемр V= %g',V);
if (TIP == 1) || (TIP == 3)
    if CR < PR
            fprintf ('\n бмхлюмхе');
            fprintf ('\n аюгнбюъ дхмюлхвеяйюъ пюдхюкэмюъ пюявермюъ цпсгнондзEлмнярэ');
            fprintf ('\n лемэье  аюгнбни дхмюлхвеяйни щйбхбюкемрмни пюдхюкэмни мюцпсгйх');
            fprintf ('\n  C(r)= %g  P(r)= %g',CR,PR);
            fprintf ('\n бмхлюмхе');
            fprintf (fid,'\n аюгнбюъ дхмюлхвеяйюъ пюдхюкэмюъ пюявермюъ цпсгнондзEлмнярэ');
            fprintf (fid,'\n лемэье  аюгнбни дхмюлхвеяйни щйбхбюкемрмни пюдхюкэмни мюцпсгйх');
            fprintf (fid,'\n  C(r)= %g  P(r)= %g',CR,PR);
            return
    end
    fprintf (fid,'\n аюгнбюъ дхмюлхвеяйюъ пюдхюкэмюъ пюявермюъ цпсгнондзEлмнярэ:');
    fprintf (fid,'\n C(r)= %g ',CR);
    fprintf (fid,'\n аюгнбюъ дхмюлхвеяйюъ щйбхбюкемрмюъ пюдхюкэмюъ мюцпсгйю:');
    fprintf (fid,'\n P(r)= %g',PR);
end
if (TIP == 2) || (TIP == 4)
    if CR < PR
            fprintf ('\n бмхлюмхе');
            fprintf ('\n аюгнбюъ дхмюлхвеяйюъ няебюъ пюявермюъ цпсгнондзEлмнярэ');
            fprintf ('\n лемэье  аюгнбни дхмюлхвеяйни щйбхбюкемрмни няебни мюцпсгйх');
            fprintf ('\n  C(a)= %g  P(a)= %g',CR,PR);
            fprintf ('\n бмхлюмхе');
            fprintf (fid,'\n аюгнбюъ дхмюлхвеяйюъ няебюъ пюявермюъ цпсгнондзEлмнярэ');
            fprintf (fid,'\n лемэье  аюгнбни дхмюлхвеяйни щйбхбюкемрмни няебни мюцпсгйх');
            fprintf (fid,'\n  C(a)= %g  P(a)= %g',CR,PR);
            return
    end    
    fprintf (fid,'\n аюгнбюъ дхмюлхвеяйюъ няебюъ пюявермюъ цпсгнондзEлмнярэ C(a)=:- %g ',CR);
    fprintf (fid,'\n аюгнбюъ дхмюлхвеяйюъ щйбхбюкемрмюъ няебюъ мюцпсгйю P(a)=%g',PR);
end
if L10 < LT
     fprintf ('\n бмхлюмхе');
     fprintf ('\n аюгнбши пюявермши пеяспя лемэье рпеаселнцн');
     fprintf ('\n аюгнбши пюявермши пеяспя, [лхк.нанпнрнб L(10)=%g',L10);
     fprintf ('\n рпеаселши пеяспя, [лхк.нанпнрнб]   L(T)=%g',LT);
     fprintf (fid,'\n бмхлюмхе');
     fprintf (fid,'\n аюгнбши пюявермши пеяспя лемэье рпеаселнцн');
     fprintf (fid,'\n аюгнбши пюявермши пеяспя, [лхк.нанпнрнб L(10)=%g',L10);
     fprintf (fid,'\n рпеаселши пеяспя, [лхк.нанпнрнб]   L(T)=%g',LT);
end
fprintf (fid,'\n йнщттхжхемр A(23)= %g',A23);
fprintf (fid,'\n аюгнбши пюявермши пеяспя, [лхк.нанпнрнб L(10)=%g',L10);
fprintf (fid,'\n рпеаселши пеяспя, [лхк.нанпнрнб]   L(T)=%g',LT);
fprintf (fid,'\n пюявермши пеяспя ондьхомхйнб б йхкнлерпюу опнаецю  L(s)=%g',LS);
end

